import dendy1 from "../assets/audio/dendy/dendy1.mp3";
import dendy2 from "../assets/audio/dendy/dendy2.mp3";
import dendy3 from "../assets/audio/dendy/dendy3.mp3";
import dendy4 from "../assets/audio/dendy/dendy4.mp3";
import dendy5 from "../assets/audio/dendy/dendy5.mp3";
import dendy6 from "../assets/audio/dendy/dendy6.mp3";
import sega1 from "../assets/audio/sega/sega1.mp3";
import sega2 from "../assets/audio/sega/sega2.mp3";
import sega3 from "../assets/audio/sega/sega3.mp3";
import sega4 from "../assets/audio/sega/sega4.mp3";
import sega5 from "../assets/audio/sega/sega5.mp3";
import sega6 from "../assets/audio/sega/sega6.mp3";
import psOne1 from "../assets/audio/ps1/psOne1.mp3";
import psOne2 from "../assets/audio/ps1/psOne2.mp3";
import psOne3 from "../assets/audio/ps1/psOne3.mp3";
import psOne4 from "../assets/audio/ps1/psOne4.mp3";
import psOne5 from "../assets/audio/ps1/psOne5.mp3";
import psOne6 from "../assets/audio/ps1/psOne6.mp3";
import psTwo1 from "../assets/audio/ps2/psTwo1.mp3";
import psTwo2 from "../assets/audio/ps2/psTwo2.mp3";
import psTwo3 from "../assets/audio/ps2/psTwo3.mp3";
import psTwo4 from "../assets/audio/ps2/psTwo4.mp3";
import psTwo5 from "../assets/audio/ps2/psTwo5.mp3";
import psTwo6 from "../assets/audio/ps2/psTwo6.mp3";
import pc1 from "../assets/audio/pc/pc1.mp3";
import pc2 from "../assets/audio/pc/pc2.mp3";
import pc3 from "../assets/audio/pc/pc3.mp3";
import pc4 from "../assets/audio/pc/pc4.mp3";
import pc5 from "../assets/audio/pc/pc5.mp3";
import pc6 from "../assets/audio/pc/pc6.mp3";
import mobile1 from "../assets/audio/mobile/mobile1.mp3";
import mobile2 from "../assets/audio/mobile/mobile2.mp3";
import mobile3 from "../assets/audio/mobile/mobile3.mp3";
import mobile4 from "../assets/audio/mobile/mobile4.mp3";
import mobile5 from "../assets/audio/mobile/mobile5.mp3";
import mobile6 from "../assets/audio/mobile/mobile6.mp3";

import imgdendy1 from "../assets/img/dendy/imgdendy1.jpeg";
import imgdendy2 from "../assets/img/dendy/imgdendy2.jpeg";
import imgdendy3 from "../assets/img/dendy/imgdendy3.jpeg";
import imgdendy4 from "../assets/img/dendy/imgdendy4.jpeg";
import imgdendy5 from "../assets/img/dendy/imgdendy5.png";
import imgdendy6 from "../assets/img/dendy/imgdendy6.png";
import imgsega1 from "../assets/img/sega/imgsega1.jpeg";
import imgsega2 from "../assets/img/sega/imgsega2.jpeg";
import imgsega3 from "../assets/img/sega/imgsega3.jpeg";
import imgsega4 from "../assets/img/sega/imgsega4.jpeg";
import imgsega5 from "../assets/img/sega/imgsega5.jpeg";
import imgsega6 from "../assets/img/sega/imgsega6.png";
import imgpsOne1 from "../assets/img/ps1/imgpsOne1.jpeg";
import imgpsOne2 from "../assets/img/ps1/imgpsOne2.png";
import imgpsOne3 from "../assets/img/ps1/imgpsOne3.jpeg";
import imgpsOne4 from "../assets/img/ps1/imgpsOne4.jpeg";
import imgpsOne5 from "../assets/img/ps1/imgpsOne5.jpeg";
import imgpsOne6 from "../assets/img/ps1/imgpsOne6.jpeg";
import imgpsTwo1 from "../assets/img/ps2/imgpsTwo1.png";
import imgpsTwo2 from "../assets/img/ps2/imgpsTwo2.jpeg";
import imgpsTwo3 from "../assets/img/ps2/imgpsTwo3.jpeg";
import imgpsTwo4 from "../assets/img/ps2/imgpsTwo4.jpeg";
import imgpsTwo5 from "../assets/img/ps2/imgpsTwo5.jpeg";
import imgpsTwo6 from "../assets/img/ps2/imgpsTwo6.jpeg";
import imgpc1 from "../assets/img/pc/imgpc1.jpeg";
import imgpc2 from "../assets/img/pc/imgpc2.jpeg";
import imgpc3 from "../assets/img/pc/imgpc3.jpeg";
import imgpc4 from "../assets/img/pc/imgpc4.jpeg";
import imgpc5 from "../assets/img/pc/imgpc5.jpeg";
import imgpc6 from "../assets/img/pc/imgpc6.jpeg";
import imgmobile1 from "../assets/img/mobile/imgmobile1.png";
import imgmobile2 from "../assets/img/mobile/imgmobile2.jpeg";
import imgmobile3 from "../assets/img/mobile/imgmobile3.jpeg";
import imgmobile4 from "../assets/img/mobile/imgmobile4.jpeg";
import imgmobile5 from "../assets/img/mobile/imgmobile5.png";
import imgmobile6 from "../assets/img/mobile/imgmobile6.jpeg";

const gamesData = [
  [
    {
      id: 1,
      name: "Super Mario Bros",
      genre: "Платформер",
      description:
        "Главными героями игры являются водопроводчик Марио и его брат Луиджи (в качестве игрового персонажа для второго игрока). Цель игры — пройти через Грибное королевство, ускользая или уничтожая солдат черепашьего Короля Купы (также известного как Боузер), чтобы спасти захваченную им в плен Принцессу.",
      image: imgdendy1,
      audio: dendy1,
    },
    {
      id: 2,
      name: "DuckTales",
      genre: "Платформер",
      description:
        "В игре игрок управляет селезнем Скруджем МакДаком одетым в чёрный цилиндр, пиджак и гамаши, с тростью и в пенсне. Скруджем МакДаком движет жажда завладеть сокровищами и стать самым богатым селезнем в мире. Сюжет игры не следует напрямую сюжетным линиям мультсериала, однако как в игре, так и в мультфильме Скрудж МакДак путешествует по различным уголкам планеты, с целью найти давно утерянные сокровища.",
      image: imgdendy2,
      audio: dendy2,
    },
    {
      id: 3,
      name: "Contra",
      genre: "Шутер",
      description:
        "12 сентября 2631 года неподалёку от Новой Зеландии падает метеорит. Спустя два года появляется некая террористическая организация под названием «Красный сокол», поставившая перед собой задачу уничтожить всё человечество. База «Красного сокола» находится на некоем острове. Действие игры начинается, когда два бойца Билл Райзер и Лэнс Бин, ставшие до этого Контра (бойцами, мастерски владеющими навыками ведения партизанской войны), высаживаются на остров, чтобы уничтожить базу и спасти мир. По мере проникновения на вражескую территорию бойцы выясняют, что за организацией «Красный сокол» стоят инопланетные пришельцы, прибывшие на метеорите. Главной задачей героев становится нахождение логова пришельцев и уничтожение их сердца.",
      image: imgdendy3,
      audio: dendy3,
    },
    {
      id: 4,
      name: "Teenage Mutant Ninja Turtles",
      genre: "Платформер",
      description:
        "Черепашки-ниндзя (Леонардо, Рафаэлем, Микеланджело и Донателло) должны достать у Шредера Лазер превращения, устройство, которое может вернуть их учителю Сплинтеру его человеческую форму. Вначале они отправляются спасать Эйприл О’Нил, которую захватили в плен Бибоп и Рокстеди. После спасения Эйприл, черепашки должны опуститься под воду, чтобы обезвредить бомбы, заложенные у основания дамбы. Затем спасти Сплинтера от Меха Черепахи, уничтожить гигантского крысолова, найти Технодром и победить Шредера.",
      image: imgdendy4,
      audio: dendy4,
    },
    {
      id: 5,
      name: "Bomberman",
      genre: "Аркада",
      description:
        "Бомбермен — это робот, производящий бомбы на подземном предприятии, возглавляемом некими «злыми силами». Однажды до него дошёл слух, что робот, выбравшийся на поверхность, может стать человеком. Принудительная работа не нравилась Бомбермену, и он решает сбежать. Его объявляют предателем, посылая в погоню множество врагов.",
      image: imgdendy5,
      audio: dendy5,
    },
    {
      id: 6,
      name: "Battle City",
      genre: "Аркада",
      description:
        "Полигон действий виден сверху. Игрок должен, управляя своим танком, уничтожить все вражеские танки на уровне, которые постепенно появляются вверху игрового поля. Враги пытаются уничтожить штаб игрока (внизу игрового поля в виде орла) и его танк. На каждом уровне нужно уничтожить двадцать единиц бронетехники противника разных видов. Если противник (или игрок) сможет разрушить штаб или лишит игрока всех жизней — игра окончена.",
      image: imgdendy6,
      audio: dendy6,
    },
  ],
  [
    {
      id: 1,
      name: "Sonic the Hedgehog",
      genre: "Платформер",
      description:
        "По сюжету, главный герой игры — ёж по имени Соник — впервые встречается со злодеем доктором Роботником, который стремится захватить власть над всем миром. Учёный использует разных зверей для создания своих роботов, называемых бадниками (англ. Badnik), и пытается заполучить шесть мистических драгоценных камней, Изумрудов Хаоса, чтобы ещё больше усилить своё могущество. Соник стремится освободить своих друзей, уничтожить машины Роботника, получить камни первым и нарушить планы злодея.",
      image: imgsega1,
      audio: sega1,
    },
    {
      id: 2,
      name: "Mortal Kombat",
      genre: "Файтинг",
      description:
        "Игра сконцентрирована на жестоком турнире под названием «Смертельная битва», который проводит злой колдун Шан Цзун. Все персонажи по разным причинам участвуют в турнире. Основная сюжетная линия была расширена через комиксы и сиквелы. В игру были введены ключевые аспекты серии Mortal Kombat, в том числе уникальная система управления и кровавые добивания — Fatality.",
      image: imgsega2,
      audio: sega2,
    },
    {
      id: 3,
      name: "Mr. Nutz",
      genre: "Платформер",
      description:
        "Кто как не отважный бельчонок именуемый мистером Орешником способен спасти планету от надвигающегося ледникового периода! Вместе с ним вам предстоит отправиться в опасное приключение по искоренению разбойничающих йети и других надоедливых тварей, прислуживающих злобному мистеру Бурану, который решил, что его владения должны простираться намного дальше верхушки земного шара во всех направлениях.",
      image: imgsega3,
      audio: sega3,
    },
    {
      id: 4,
      name: "Rock n' Roll Racing",
      genre: "Боевые гонки",
      description:
        "Перед вами убойная гоночная игра с элементами боевика! Полный беспредел на дороге вам обеспечен, ведь в этих гонках нет никаких правил, зато есть различные вооруженные болиды, а также безбашенные гонщики готовые на всё ради победы. Вы как раз и являетесь одним из таких гонщиков, путешествуете по планетам, участвуете в заездах, чтобы завоевать звание лучшего из лучших. Игра наполнена драйвом, игровой процесс постоянно держит вас в напряжении. Музыкальные треки в исполнении таких легендарных групп как Led Zepplin, Deep Purple, Black Sabbat просто идеально вписываются в атмосферу гонок. Rock N' Roll Racing несомненно является одной из лучших, а возможно даже и самой лучшей игрой в данном жанре.",
      image: imgsega4,
      audio: sega4,
    },
    {
      id: 5,
      name: "Jurassic Park",
      genre: "Боевик",
      description:
        "Грант проезжал на электромобиле мимо вольеров с динозаврами. Внезапная молния отключает все системы, и динозавры вырываются на свободу. На машину Гранта нападает тираннозавр, в результате чего доктор оказывается в джунглях. Из джунглей ему нужно добраться до Центра посетителей, чтобы спастись с острова.",
      image: imgsega5,
      audio: sega5,
    },
    {
      id: 6,
      name: "Golden Axe II",
      genre: "Избей их всех",
      description:
        "Главный герой должен пройти по сказочному миру и вернуть волшебный топор, победив злодея Дарк Гульда",
      image: imgsega6,
      audio: sega6,
    },
  ],
  [
    {
      id: 1,
      name: "Spyro - Year of the Dragon",
      genre: "Платформер",
      description:
        "Игра начинается с празднования в земле драконов, когда Спайро и его родственники празднуют «Год Дракона» — событие, которое проходит каждые двенадцать лет, когда в царство прибывают новые драконьи яйца. Однако, когда все драконы спали после празднования, в Драконье Царство вторгается армия существ во главе с крольчихой-чародейкой Бьянкой, которая крадёт все яйца. Однако во время переноса последних яиц кража была обнаружена, и Спайро пустился в погоню, поскольку только он и Хантер пролезали в нору через которую были вынесены яйца.",
      image: imgpsOne1,
      audio: psOne1,
    },
    {
      id: 2,
      name: "Crash Bandicoot",
      genre: "Платформер",
      description:
        "Где-то на территории Австралии учёный Доктор Нео Кортекс проводит в своей лаборатории опыты над пойманным зверьком, Крэшем. Делает он это для того, чтобы осуществить свою мечту — создать армию и поработить весь мир. Он нацеливает на несчастного бандикута пушку, называемую Evolvo Ray, способный, по легенде, давать животным человеческие способности, но по некоторому стечению обстоятельств пушка не успевает завершить свой процесс и главный герой сбегает. По-видимому, вместо того чтобы Крэш возглавлял армию доктора Кортекса и часами размышлял над тактикой проведения его мечты в жизнь, бедняга наоборот лишается своих последних мозгов и теряет дар речи. Однако доктор оказывается не таким глупым, чтобы не учесть плана Б. Он похитил девушку Крэша, Тавну. В итоге Крэш выпрыгивает в окно и оказывается на берегу острова N.Sanity и тут завязывается начало игры. В спасении своей возлюбленной на протяжении всей игры Крэшу будет помогать некий дух, заточённый в облик маски — Aku Aku. Игра насыщена разного рода юмором: даже смерти главного героя выглядят забавно.",
      image: imgpsOne2,
      audio: psOne2,
    },
    {
      id: 3,
      name: "TEKKEN 3",
      genre: "Файтинг",
      description:
        "Спустя пятнадцать лет после турнира «Король Железного Кулака 2», Хэйхати Мисима создаёт военную организацию «Tekken Force», которая должна заниматься защитой Мисима Зайбацу. Отряд ищет древний храм, расположенный в Мексике. Вскоре после прибытия туда, Хэйхати узнаёт, что отряд был уничтожен Огром. Однако Хэйхати, будучи свидетелем событий, стремится захватить Огра в надежде направить его силу для собственной выгоды. Вскоре различных мастеров боевых искусств со всего мира находят мёртвыми. Во всём этом подозревается Огр.",
      image: imgpsOne3,
      audio: psOne3,
    },
    {
      id: 4,
      name: "Silent Hill",
      genre: "Ужас выживания",
      description:
        "Действие игры происходит в одноимённом вымышленном американском городе. Сюжет разворачивается вокруг писателя Гарри Мэйсона, который ищет в Сайлент Хилле свою пропавшую приёмную дочь Шерил. В городе он обнаруживает религиозный культ, пытающийся провести ритуал с целью возрождения божества, которому этот культ поклоняется. В игре присутствует пять разных концовок, включая одну шуточную.",
      image: imgpsOne4,
      audio: psOne4,
    },
    {
      id: 5,
      name: "Gran Turismo",
      genre: "Автосимулятор",
      description:
        "Игра имеет два режима: аркадный и реалистичный. В аркадном режиме игрок может выбирать автомобили таких производителей, как Nissan, Honda, Acura и Aston Martin и других. Под каждый автомобиль создана своя карта тюнинга. Все трассы в исходной версии игры вымышлены. Реально существующие трассы, такие как Laguna Seca, Le Mans Sarthe и New York City, появились в последующих версиях игры. В реалистичном режиме игрок получает возможность делать карьеру, начиная с десяти тысяч кредитов, на которые можно купить подержанную машину. Дальше игрок должен получить одну из трёх лицензий: B-класса, А-класса или международного А-класса.",
      image: imgpsOne5,
      audio: psOne5,
    },
    {
      id: 6,
      name: "Syphon Filter",
      genre: "Шутер от третьего лица",
      description:
        "Специальный агент Габриэль Логан и его напарница Лиан Синг расследуют серию биологических терактов, ответственный за которые международный террорист Эрих Ромер. Агентство теряет связь с агентом Эллис в Коста-Рике и отправляет на его поиски Гейба и Лиан. Они находят Эллиса мёртвым, и обнаруживают, что операции по обороту наркотиков Ромера всего лишь прикрытие для нового вируса. Другой взрыв в Непале поднимает ещё больше вопросов, когда группы биохимической защиты находят инфицированного человека, который должен был умереть, но остался жив.",
      image: imgpsOne6,
      audio: psOne6,
    },
  ],
  [
    {
      id: 1,
      name: "Super Street Fighter II",
      genre: "Файтинг",
      description:
        "Street Fighter II, как следует из её названия, была второй игрой в одноимённой серии. По сравнению со своей предшественницей Street Fighter, выпущенной в 1987 году, Street Fighter II имела значительные изменения, внесённые в игровую механику, такие как усовершенствование шестикнопочного управления, специальных приёмов и возможности выбирать персонажа из нескольких бойцов, каждый из которых обладал собственным стилем боя и уникальными приёмами.",
      image: imgpsTwo1,
      audio: psTwo1,
    },
    {
      id: 2,
      name: "Need for Speed - Underground 2",
      genre: "Гонки",
      description:
        "Действия игры происходят в вымышленном городе Бэйвью. Он имеет сходства с такими реальными городами, как Лос-Анджелес и Лас-Вегас. Как и в Олимпик-Сити (городе Need for Speed: Underground), в Бэйвью не существует полиции, а действия всегда проходят в ночное время суток. По улицам города разъезжают машины, а также имеется динамическая смена погодных условий — при дожде, который может начаться и прекратиться в любой момент, управление автомобилями осложняется. Для ориентирования в городе присутствуют карта и система GPS.",
      image: imgpsTwo2,
      audio: psTwo2,
    },
    {
      id: 3,
      name: "God of War",
      genre: "Боевик",
      description:
        "Сеттинг основан на греческой мифологии, действие игры разворачивается на территории Древней Греции. Главный протагонист Кратос — спартанский воин, служащий олимпийским богам. По наставлению богини Афины Кратос должен уничтожить текущего бога войны Ареса, чтобы получить прощение олимпийских богов. Кратос соглашается, поскольку Арес причастен к убийству семьи главного героя, и отправляется в опасное путешествие, чтобы заполучить легендарный ящик Пандоры, дающий огромную силу.",
      image: imgpsTwo3,
      audio: psTwo3,
    },
    {
      id: 4,
      name: "Shadow of the Colossus",
      genre: "Боевик",
      description:
        "Сюжетная составляющая аскетична ― в Shadow of the Colossus всего два продолжительных ролика (вступительный и заключительный), раскрывающих историю. Мотивация и происхождение некоторых героев остаются неочевидными до конца игры. Наличие заброшенных сооружений указывает на то, что запретные земли когда-то были населены людьми ― в центре игровой карты расположен храм, называемый Святилищем Поклонения, к которому ведёт длинный мост из внешнего мира. В игре существует возможность пройти по мосту, но выйти за пределы запретных земель невозможно. Остальной игровой мир огорожен скалами и водой.",
      image: imgpsTwo4,
      audio: psTwo4,
    },
    {
      id: 5,
      name: "Psychonauts",
      genre: "Приключения",
      description:
        "В Psychonauts игрок управляет Разом (сокращённо от Разпутин), таинственным новичком в учебном лагере для психонавтов — элитных специальных агентов, которые используют свои пси-способности для войны с пси-террористами и чтения мыслей людей. Во время обучения он обнаруживает, что вожатый Олеандр похищает кадетов с целью захвата их мозгов. Раз должен помешать ему создать с их помощью пси-оружие.",
      image: imgpsTwo5,
      audio: psTwo5,
    },
    {
      id: 6,
      name: "Resident Evil 4",
      genre: "Ужас выживания",
      description:
        "Осень 2004 года. Леон Скотт Кеннеди, бывший офицер полиции Раккун-сити, а ныне агент правительства США, отправляется на поиски Эшли Грэм, дочери президента, похищенной из колледжа таинственным культом. Он едет в глухую испанскую деревушку, где скрылись похитители.",
      image: imgpsTwo6,
      audio: psTwo6,
    },
  ],
  [
    {
      id: 1,
      name: "Terraria",
      genre: "Песочница",
      description:
        "Игра, разработанная с использованием набора инструментов Microsoft XNA, даёт в распоряжение игрока процедурно генерируемый и изменяемый двумерный мир. Помимо добычи ресурсов и строительства сооружений, в игровом процессе Terraria также уделяется внимание исследованию мира, поиску сокровищ и сражениям с противниками.",
      image: imgpc1,
      audio: pc1,
    },
    {
      id: 2,
      name: "Fortnite",
      genre: "Королевская битва",
      description:
        "Fortnite — это кооперативная песочница на выживание, основными механиками которой являются исследование, сбор ресурсов, строительство укрепленных зданий и борьба с волнами наступающих зомби. Игроки кооперируются, чтобы собирать предметы, которые они могут использовать для строительства форта днём, а ночью защищаться от зомби. Строительство является основной механикой, при этом в игре «уйма лута». Игроки могут строить и редактировать каждую стену своего форта с сеткой 3х3, строить лестницы, крышу и окна, ваяя их в соответствии с той или иной потребностью.",
      image: imgpc2,
      audio: pc2,
    },
    {
      id: 3,
      name: "Hades",
      genre: "Рогалик",
      description:
        "Сюжет игры основан на древнегреческой мифологии: главный герой Загрей, сын Аида, пытается сбежать из подземного царства мёртвых и добраться до горы Олимп; на этом пути ему помогают боги-олимпийцы, посылающие Загрею те или иные дары. В каждом прохождении игрок должен преодолеть серию собранных случайным образом комнат с врагами и наградами; в случае смерти Загрей возвращается в самое начало пути, хотя игрок может потратить собранные за время прохождения сокровища и на улучшение характеристик или разблокировку новых видов оружия. Многочисленные прохождения Hades связываются воедино разнообразными сценами и диалогами, раскрывающими предысторию игры и отношения её персонажей.",
      image: imgpc3,
      audio: pc3,
    },
    {
      id: 4,
      name: "It Takes Two",
      genre: "приключенческий боевик",
      description:
        "It Takes Two была специально разработана для игры в кооперативном режиме на разделённом экране, а потому для игры требуется второй игрок, который также может подключиться по сети. Игроки управляют родителями маленькой девочки, находящимися на грани развода. Волшебная книга о любви превращает героев в маленьких кукол, и теперь, чтобы вернуть себе прежний облик, им необходимо перешагнуть через свои обиды и разногласия и действовать вместе, помогая друг другу в этом сложном, но ярком и эмоциональном приключении. В игре представлено множество игровых механик из игр разных жанров.",
      image: imgpc4,
      audio: pc4,
    },
    {
      id: 5,
      name: "Cuphead",
      genre: "Платформер",
      description:
        "Персонаж игрока, Чашек, проиграл в споре с дьяволом и пытается вернуть долг. Игра имеет вид разветвляющейся последовательности уровней. У Чашека бесконечное число попыток, и он не теряет оружие после смерти. У главного героя игры есть способность парирования различных объектов, закодированных розовым цветом. Успешные парирования заполняют специальный счётчик, который позволяет ему выполнять специальную способность. Уровни доступны через внешний мир в стиле action RPG, который имеет собственные секретные пути.",
      image: imgpc5,
      audio: pc5,
    },
    {
      id: 6,
      name: "Hollow Knight",
      genre: "Платформер",
      description:
        "Основная часть игрового процесса Hollow Knight завязана на исследовании мира игры, который включает в себя преодоление платформ, поиски секретов и боёв с встречающимися по дороге врагами. Игроку предстоит исследовать огромный цельный мир, используя особые улучшения для передвижения и уловки из боевой системы, например, отражение некоторых угроз ударами. Как и в любой метроидвании, во многих зонах есть преграды, которые можно преодолеть, лишь победив определённых боссов и получив улучшения, полученные с них. Таким образом игрокам придётся посещать уже исследованные зоны для поисков секретов или продвижения по сюжету. Некоторые зоны меняются по ходу сюжета, а потому повторное их посещение иногда приносит сюрпризы. Каждая зона соединена с другой несколькими переходами, а потому проходить игру можно по-разному. У каждой зоны есть своя карта, но изначально она недоступна. Для получения карты конкретной зоны нужно найти картографа в этой зоне и купить карту у него за местную валюту (или же взять её позже в магазине карт, но за большую цену), после чего самостоятельно её заполнять методом посещения локаций. ",
      image: imgpc6,
      audio: pc6,
    },
  ],
  [
    {
      id: 1,
      name: "Candy Crush Saga",
      genre: "Головоломка",
      description:
        "Игроки должны совместить три игровые конфеты одинакового цвета в ряд, чтобы те исчезли. Если совместить больше — игрок получает специальные конфеты, которые дают дополнительные возможности. Нужно собрать как можно больше очков за ограниченное количество времени или ходов. Также в игре присутствуют бомбы: с ними надо сделать любую комбинацию до прошествия числа ходов на самой бомбе. Если условия не соблюдены игроком, то он проигрывает.",
      image: imgmobile1,
      audio: mobile1,
    },
    {
      id: 2,
      name: "Monument valley",
      genre: "Инди-головоломка",
      description:
        "Задача игрока сводится к управлению персонажем по имени «принцесса Ида», которая должна найти выход из лабиринта. Всего в Monument Valley имеется 10 лабиринтов с несколькими уровнями. Игра представляет собой пошаговую головоломку, то есть игрок не может умереть в игре или совершить ошибку. Основная его задача сводится к поэтапному поиску или построению маршрутов, чтобы выйти из лабиринта. Во вселенной игры существуют оптические иллюзии и невозможные фигуры. Ида способна лазить по лестницам и пересекать округлённые объекты. Однако для пересечения разного рода барьеров, необходимо активировать механизмы, которые меняют маршруты лабиринта, или же менять ракурс камеры, чтобы при помощи оптической иллюзии найти новый маршрут прохождения.",
      image: imgmobile2,
      audio: mobile2,
    },
    {
      id: 3,
      name: "Angry Birds",
      genre: "Аркада",
      description:
        "Игрок должен запускать птиц в свиней при помощи рогатки. Уровень будет пройден, если игрок уничтожит всех свиней, в противном случае его придётся проходить заново. Чаще всего свиньи используют строения из блоков в качестве укрытия.",
      image: imgmobile3,
      audio: mobile3,
    },
    {
      id: 4,
      name: "Subway Surfers",
      genre: "Бесконечный бег",
      description:
        "В начале каждой игры игроку демонстрируется кат-сцена, в которой персонаж игрока рисует граффити на одном из вагонов метро. Хулигана замечает инспектор с собакой, после чего начинается погоня по железнодорожным путям. Основная цель игры состоит в том, чтобы игрок, ускоряясь, пробежал как можно дальше, уворачиваясь от встречных поездов и других препятствий. С увеличением ускорения игрока — проходить препятствия становится сложнее. Если игрок с чем-то сталкивается, то инспектор его догоняет (причём вне зависимости от того, насколько далеко он успел убежать) и игра заканчивается. Но этого можно избежать, если во время столкновения использовалась доска для сёрфинга, в противном случае есть возможность потратить ключи и продолжить погоню. ",
      image: imgmobile4,
      audio: mobile4,
    },
    {
      id: 5,
      name: "Crashlands",
      genre: "Приключенческий боевик",
      description:
        "Сюжет игры начинается с того, что космический корабль Flux терпит крушение на планете Woanope. Всему виной злодей Hewgodooko, который просто взял, и забрал важный кусок корабля. Flux является космическим посыльным, поэтому основной задачей считает быстрейшую установку связи с родной планетой и вызов эвакуатора. Собственно, его работа должна быть выполнена в срок, так или иначе. Вот только для выполнения миссии необходим источник энергии , которые, в следствие печального стечения обстоятельств, также ищет Hewgodooko, сметая всё на своём пути. Соответственно, в одиночку выполнить задачу не представляется возможным. По мере игры нам будет помогать робот-помощник JuiceBox.",
      image: imgmobile5,
      audio: mobile5,
    },
    {
      id: 6,
      name: "Geometry Dash",
      genre: "Платформер",
      description:
        "В игре присутствует скрытый сюжет. Игра содержит 21 встроенный уровень, 18 из которых открыты для прохождения сразу, ещё три открываются после сбора на других уровнях определённого количества монет. Также в игре есть секретный уровень, который становится доступен после сбора двухсот алмазов. Уровни представляют собой полосы препятствий, по которым движется персонаж игрока, принимающий одну из нескольких форм, каждая из которых движется по-своему, и длятся в среднем полторы-две минуты. Полоса препятствий синхронизирована с саундтреком уровня, в качестве которого выступают электронные музыкальные треки.",
      image: imgmobile6,
      audio: mobile6,
    },
  ],
];
export default gamesData;
